app/Controllers/Admin/Admin.php

    public function __construct()
    {
        $this->db= \Config\Database::connect();
        $this->customer_model = new \App\Models\Customer();
        $this->orders_model = new \App\Models\Orders();
        $this->product_model = new \App\Models\Products();
        $this->orders_model=new \App\Models\Orders();
        $this->orders_product_model=new \App\Models\Order_products();
        $this->product_images=new \App\Models\Product_images();
        $this->admin_user=new \App\Models\Admin_user();
        $this->site_general=new \App\Models\Site_general();
        $this->site_settings=["site_settings"=>$this->site_general->select("logo,favicon")->find(1)];
---
SELECT `logo`, `favicon`
FROM `site_general`
WHERE `site_general`.`ID` = 1

    public function is_logged(){

        if(!session()->has("admin_logged") && !session()->has("admin_logged_user")){
            return false;
        }
        $this->admin_user_info=["user"=>$this->admin_user->select("username")->where("ID",session()->get("admin_logged_user"))->find()[0]];
---
SELECT `username`
FROM `user`
WHERE `ID` = '1'

    public function index(){
        if(!$this->is_logged()){
            return redirect()->to("admin");
        }
        if(isset($_POST["get_table"])){
            if($_POST["get_table"]==1){
                $data=[
                    1=>0,2=>0,3=>0,4=>0,5=>0,6=>0,7=>0,8=>0,9=>0,10=>0,11=>0,12=>0
                ];
                $montly_sale=$this->orders_model->select("count(*) as 'count',month(order_date) as 'ay'")->groupBy("month(order_date)")->findAll();
                if(count($montly_sale)!=0){
                    $data[$montly_sale[0]["ay"]]=$montly_sale[0]["count"];
                }
            }
            else{
                $data=[
                    2012=>0,2013=>0,2014=>0,2015=>0,2016=>0,2017=>0,2018=>0,2019=>0,2020=>0,2021=>0,2022=>0,2023=>0
                ];
                $yearly_sale=$this->orders_model->select("count(*) as 'count',year(order_date) as 'yıl'")->groupBy("month(order_date)")->findAll();
                if(count($yearly_sale)!=0){
                    $data[$yearly_sale[0]["yıl"]]=$yearly_sale[0]["count"];
                }
            }
            echo json_encode($data);
            die();
        }
        $order_status_model=new \App\Models\Order_statuses();
        $data=[
            ...$this->admin_user_info,
            ...$this->site_settings,
            "total_order"=>$this->orders_model->countAllResults(),
            "total_earning"=>$this->orders_model->select("sum(order_total) as 'total'")->find()[0]["total"] ?? 0,
            "ortalama_fiyat"=>$this->orders_model->select("avg(order_total) as 'avg'")->find()[0]["avg"] ?? 0,
            "motnhs"=>[1,2,3,4,5,6,7,8,9,10,11,12],
            "montly_sale"=>[0,0,0,0,0,0,0,0,0,0,0,0],
            "montly_earning"=>$this->orders_model->select("sum(order_total) as 'total'")->where("month(order_date)",date("n"))->find()[0]["total"] ?? 0,
            "last_month_earning"=>$this->orders_model->select("sum(order_total) as 'total'")->where("month(order_date)",date("n")-1)->find()[0]["total"] ?? 0,
            "diff_from_last_month"=>0,
            "last_orders"=>$this->orders_model
            ->select("customer.full_name,orders.ID as 'order_id',orders.payment_id,order_statuses.status as 'order_status_txt',order_statuses.ID as 'order_status_id',order_total,order_date")
            ->join("customer","customer.ID=orders.customer_id")
            ->join("order_statuses","order_statuses.ID=orders.order_status")
            ->orderBy("orders.order_date","desc")
            ->findAll("5"),
            "order_statuses"=>$order_status_model->findAll()
        ];
        $montly_sale=$this->orders_model->select("count(*) as 'count',month(order_date) as 'ay'")->groupBy("month(order_date)")->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `orders`
SELECT sum(order_total) as 'total'
FROM `orders`
WHERE month(order_date) = '6'
SELECT sum(order_total) as 'total'
FROM `orders`
WHERE month(order_date) = 5
SELECT sum(order_total) as 'total'
FROM `orders`
WHERE month(order_date) = '7'
SELECT sum(order_total) as 'total'
FROM `orders`
WHERE month(order_date) = 6
SELECT `customer`.`full_name`, orders.ID as 'order_id', `orders`.`payment_id`, order_statuses.status as 'order_status_txt', order_statuses.ID as 'order_status_id', `order_total`, `order_date`
FROM `orders`
JOIN `customer` ON `customer`.`ID`=`orders`.`customer_id`
JOIN `order_statuses` ON `order_statuses`.`ID`=`orders`.`order_status`
ORDER BY `orders`.`order_date` DESC
 LIMIT 5
SELECT *
FROM `order_statuses`
SELECT count(*) as 'count', month(order_date) as 'ay'
FROM `orders`
GROUP BY month(order_date)