app/Controllers/Admin/Customers.php

    public function __construct()
    {
        $this->address_model= new \App\Models\Addresses();
        $this->customer_model= new  \App\Models\Customer();
        $this->db= \Config\Database::connect();
        $this->admin_user=new \App\Models\Admin_user();
        $this->site_general=new \App\Models\Site_general();
        $this->site_settings=["site_settings"=>$this->site_general->select("logo,favicon")->find(1)];
---
SELECT `logo`, `favicon`
FROM `site_general`
WHERE `site_general`.`ID` = 1

    public function is_logged(){

        if(!session()->has("admin_logged") && !session()->has("admin_logged_user")){
            return false;
        }

        $this->admin_user_info=["user"=>$this->admin_user->select("username")->where("ID",session()->get("admin_logged_user"))->find()[0]];
---
SELECT `username`
FROM `user`
WHERE `ID` = '1'

    public function index(){
        if(!$this->is_logged()){
            return redirect()->to("admin");
        }
        $data=[
            ...$this->admin_user_info,
            ...$this->site_settings,
            "customers"=>[]
        ];
        $customers=$this->customer_model->select("ID,full_name,email")->findAll();
---
SELECT `ID`, `full_name`, `email`
FROM `customer`

    public function customer_delete(){
        $request = \Config\Services::request();
        if($request->isAjax()){
            $json=$request->getJSON(true);
            $this->customer_model->delete($json["ID"]);
---
DELETE FROM `customer`
WHERE `ID` IN ('77')