app/Controllers/Admin/Products.php

    public function __construct()
    {
        $this->db = \Config\Database::connect();
        $this->customer_model = new \App\Models\Customer();
        $this->orders_model = new \App\Models\Orders();
        $this->product_model = new \App\Models\Products();
        $this->orders_model = new \App\Models\Orders();
        $this->orders_product_model = new \App\Models\Order_products();
        $this->product_images_model = new \App\Models\Product_images();
        $this->category_model = new \App\Models\Categories_model();
        $this->brands_model = new \App\Models\Brands_model();
        $this->product_desc_model = new \App\Models\Product_desc();
        $this->admin_user=new \App\Models\Admin_user();
        $this->site_general=new \App\Models\Site_general();
        $this->site_settings=["site_settings"=>$this->site_general->select("logo,favicon")->find(1)];
---
SELECT `logo`, `favicon`
FROM `site_general`
WHERE `site_general`.`ID` = 1

    public function is_logged(){

        if(!session()->has("admin_logged") && !session()->has("admin_logged_user")){
            return false;
        }

        $this->admin_user_info=["user"=>$this->admin_user->select("username")->where("ID",session()->get("admin_logged_user"))->find()[0]];
---
SELECT `username`
FROM `user`
WHERE `ID` = '1'

    public function index()
    {
        if(!$this->is_logged()){
            return redirect()->to("admin");
        }
        $data = [
            ...$this->admin_user_info,
            ...$this->site_settings,
            "products" => []
        ];
        $products = $this->product_model
            ->select("product_images.image,products.ID,products.product_name")
            ->join("product_images", "product_images.product=products.ID", "right")
            ->where("product_images.is_main", 1)
            ->findAll();
---
SELECT `product_images`.`image`, `products`.`ID`, `products`.`product_name`
FROM `products`
RIGHT JOIN `product_images` ON `product_images`.`product`=`products`.`ID`
WHERE `product_images`.`is_main` = 1

    public function product_edit_v($id)
    {
        if(!$this->is_logged()){
            return redirect()->to("admin");
        }
        $data = [
            ...$this->admin_user_info,
            ...$this->site_settings,
            "ID" => $id,
            "product_name" => "",
            "product_price" => 0,
            "product_brand" => "",
            "product_category" => "",
            "product_status" => 2,
            "is_discounted" => 0,
            "is_new" => 0,
            "discounted_price" => 0,
            "product_desc" => $this->product_desc_model->where("product_id", $id)->find()[0]["desc"] ?? "",
---
SELECT *
FROM `product_desc`
WHERE `product_id` = '50'

            $data["brands"][$b["ID"]]["name"]= $b["brand"];
            $data["brands"][$b["ID"]]["ID"]= $b["ID"];
        }
        $product = $this->product_model->where("ID", $id)->findAll();
---
SELECT *
FROM `products`
WHERE `ID` = '50'

            $data["product_name"] = $pr["product_name"];
            $data["product_price"] = $pr["product_price"];
            if (!is_null($pr["product_brand"])) {
                $pp = $this->brands_model->where("ID", $pr["product_brand"])->find()[0]["brand"];
---
SELECT *
FROM `product_brands`
WHERE `ID` = '17'

                $data["product_brand"] = "null";
            }
            if (!is_null($pr["product_category"])) {
                $c = $this->category_model->where("ID", $pr["product_category"])->find()[0]["category"];
---
SELECT *
FROM `product_categories`
WHERE `ID` = '1'

    public function product_images_v($ID)
    {
        if(!$this->is_logged()){
            return redirect()->to("admin");
        }
        $data = [
            ...$this->admin_user_info,
            ...$this->site_settings,
            "ID" => $ID,
            "images"=>[]
        ];
        $images = $this->product_images_model->where("product", $ID)->findAll();
---
SELECT *
FROM `product_images`
WHERE `product` = '50'

    public function product_images($id)
    {
        $request = \Config\Services::request();
        $files = $request->getFile("file");
        $product = $this->product_model->find($id);
        $product_name = $product["product_name"];
        $image_path = ROOTPATH . "public/assets/img/product/" . $product_name;
        if (!file_exists($image_path . "/" . $files->getName())) {
            $files->move($image_path);
            $db_img_path = "assets/img/product/" . $product_name . "/" . $files->getName();
            $arr = [
                "product" => $id,
                "image" => $db_img_path,
                "is_main" => 0
            ];
            $this->product_images_model->insert($arr);
---
SELECT *
FROM `products`
WHERE `products`.`ID` = '50'
INSERT INTO `product_images` (`product`, `image`, `is_main`) VALUES ('50', 'assets/img/product/RubaTrend Kalıcı Takma Tırnak Badem Şekilli Model Set 24 Adet/1_org_zoom.webp', 0)