app/Controllers/Admin/Social.php

SELECT `logo`, `favicon`
FROM `site_general`
WHERE `site_general`.`ID` = 1
---
    public function __construct()
    {
        $this->db=\Config\Database::connect();
        $this->social=new \App\Models\Social_media();
        $this->view_folder="Admin/Admin/social_media";
        $this->admin_user=new \App\Models\Admin_user();
        $this->site_general=new \App\Models\Site_general();
        $this->site_settings=["site_settings"=>$this->site_general->select("logo,favicon")->find(1)];

SELECT `username`
FROM `user`
WHERE `ID` = '1'
---
    public function is_logged(){

        if(!session()->has("admin_logged") && !session()->has("admin_logged_user")){
            return false;
        }

        $this->admin_user_info=["user"=>$this->admin_user->select("username")->where("ID",session()->get("admin_logged_user"))->find()[0]];