app/Controllers/Account.php

SELECT `phone_number`, `address`, `email`
FROM `contact_info`
WHERE `contact_info`.`ID` = 1
SELECT `facebook`, `instagram`, `twitter`, `tiktok`, `youtube`
FROM `social_media`
WHERE `social_media`.`ID` = 1
SELECT `logo`, `favicon`, `footer_text`, `copyright`, `header_text`
FROM `site_general`
WHERE `site_general`.`ID` = 1
SELECT COUNT(*) AS `numrows`
FROM `customer`
WHERE `ID` = '81'
---
    public function __construct()
    {
        $this->db = \Config\Database::connect();
        $this->cart_model = new \App\Models\Cart();
        $this->customer_model = new \App\Models\Customer();
        $this->orders_model = new \App\Models\Orders();
        $this->address_model = new \App\Models\Addresses();
        $this->cities_model=new \App\Models\Cities_model();
        $this->order_products_model=new \App\Models\Order_products();
        $this->site_general=new \App\Models\Site_general();
        $this->social_media=new \App\Models\Social_media();
        $this->contact_info=new \App\Models\Contact_info();
        $this->contact_info_data=["contact_info" =>$this->contact_info->select("phone_number,address,email")->find(1)];
        $this->social_media_data=["social_media"=>$this->social_media->select("facebook,instagram,twitter,tiktok,youtube")->find(1)];
        $this->site_general_data=["site_general"=>$this->site_general->select("logo,favicon,footer_text,copyright,header_text")->find(1)];
        session();
        if ((session()->has("ID")) && (session()->has("logged"))) {
            if($this->customer_model->where("ID",session()->get("ID"))->countAllResults()==0){

SELECT `first_name`, `last_name`
FROM `customer`
WHERE `customer`.`ID` = '81'
SELECT `orders`.`ID`, `order_date`, `status`, `order_total`, `payment_id`
FROM `orders`
INNER JOIN `order_statuses` ON `order_statuses`.`ID`=`orders`.`order_status`
WHERE `customer_id` = '81'
---
    public function index()
    {
        if ($this->is_logged()) {
            $customer = $this->customer_model->select("first_name,last_name")->find($_SESSION["ID"]);
            $orders = $this->orders_model->select("orders.ID,order_date,status,order_total,payment_id")
            ->join("order_statuses", "order_statuses.ID=orders.order_status", "inner")
            ->where('customer_id', $_SESSION["ID"])->find();

SELECT `addresses`.`ID`, `customer_id`, `address_name`, `cities`.`city`, `full_address`, `phone_number`, `picker_first_name`, `picker_last_name`
FROM `addresses`
INNER JOIN `cities` ON `addresses`.`city`=`cities`.`ID`
WHERE `customer_id` = '80'
---
    public function adress()
    {
        if ($this->is_logged()) {
            $data = [
                "cart_count" => $this->cart_data,
                "ID" => [],
                "address_name" => [],
                "city" => [],
                "full_address" => [],
                "picker_firstname" => [],
                "picker_lastname" => [],
                "phone_number" => [],
                ...$this->contact_info_data,
                ...$this->social_media_data,
                ...$this->site_general_data,
            ];
            $query = $this->address_model->select("addresses.ID,customer_id,address_name,cities.city,full_address,phone_number,picker_first_name,picker_last_name")
            ->join("cities","addresses.city=cities.ID","inner")->where("customer_id", $_SESSION["ID"])->findAll();

INSERT INTO `addresses` (`customer_id`, `picker_first_name`, `picker_last_name`, `address_name`, `full_address`, `phone_number`, `city`) VALUES ('80', 'efe', 'şengül', 'ev', 'deneme', '123123123', '35')
---
    public function add_address()
    {
        if ($this->request->isAjax()) {
            $data = $this->request->getVar();
            $address = [
                "customer_id" => $_SESSION["ID"],
                "picker_first_name" => $data->picker_firstname,
                "picker_last_name" => $data->picker_lastname,
                "address_name" => $data->address_name,
                "full_address" => $data->full_address,
                "phone_number" => $data->phone_number,
                "city"=>$data->city
            ];
            try{
                if($data->address_id==""){
                    $this->address_model->insert($address);