app/Controllers/Cart.php

    public function __construct()
    {
        $this->product_model = new \App\Models\Products();
        $this->db = \Config\Database::connect();
        $this->cart_model = new \App\Models\Cart();
        $this->customer_model = new \App\Models\Customer();
        $this->address_model = new \App\Models\Addresses();
        $this->orders_model = new \App\Models\Orders();
        $this->order_pr_model = new \App\Models\Order_products();
        $this->discount_model = new \App\Models\Discounts();
        $this->cities_model=new \App\Models\Cities_model();
        $this->contact_info=new \App\Models\Contact_info();
        $this->site_general=new \App\Models\Site_general();
        $this->social_media=new \App\Models\Social_media();
        $this->contact_info_data=["contact_info" =>$this->contact_info->select("phone_number,address,email")->find(1)];
        $this->social_media_data=["social_media"=>$this->social_media->select("facebook,instagram,twitter,tiktok,youtube")->find(1)];
        $this->site_general_data=["site_general"=>$this->site_general->select("logo,favicon,footer_text,copyright,header_text")->find(1)];
        session();
        if ((session()->has("ID")) && (session()->has("logged"))) {
            if($this->customer_model->where("ID",session()->get("ID"))->countAllResults()==0){
---
SELECT `phone_number`, `address`, `email`
FROM `contact_info`
WHERE `contact_info`.`ID` = 1
SELECT `facebook`, `instagram`, `twitter`, `tiktok`, `youtube`
FROM `social_media`
WHERE `social_media`.`ID` = 1
SELECT `logo`, `favicon`, `footer_text`, `copyright`, `header_text`
FROM `site_general`
WHERE `site_general`.`ID` = 1
SELECT COUNT(*) AS `numrows`
FROM `customer`
WHERE `ID` = '81'

    public function index()
    {
        $customer_id = $_COOKIE["aid"];
        if (session()->has("ID") && session()->has("logged")) {
            $customer_id = session()->get("ID");
        }
        $cart_items = $this->cart_model->select("shopping_cart.quantity,products.ID,products.product_name,products.product_price,products.is_discounted,products.discounted_price,product_images.image,product_statuses.status,product_colors.color")
        ->join("products","products.ID=shopping_cart.product_id")
        ->join("product_images", "product_images.product=products.ID", "inner")
        ->join("product_statuses", "products.product_status=product_statuses.ID", "inner")
        ->join("product_colors", "products.product_color=product_colors.ID", "inner")
        ->where(["product_images.is_main" => "1","shopping_cart.customer_id"=>$customer_id])->findAll();
        $data = [
            "cart_count" => $this->cart_data,
            "products"=> $cart_items,
            "subtotal" => 0,
            "total" => $this->cart_model
            ->select("sum(products.product_price*quantity) as 'total'")
            ->join("products","products.ID=shopping_cart.product_id")
            ->where("customer_id",$customer_id)
            ->find()[0]["total"],
---
SELECT `shopping_cart`.`quantity`, `products`.`ID`, `products`.`product_name`, `products`.`product_price`, `products`.`is_discounted`, `products`.`discounted_price`, `product_images`.`image`, `product_statuses`.`status`, `product_colors`.`color`
FROM `shopping_cart`
JOIN `products` ON `products`.`ID`=`shopping_cart`.`product_id`
INNER JOIN `product_images` ON `product_images`.`product`=`products`.`ID`
INNER JOIN `product_statuses` ON `products`.`product_status`=`product_statuses`.`ID`
INNER JOIN `product_colors` ON `products`.`product_color`=`product_colors`.`ID`
WHERE `product_images`.`is_main` = '1'
AND `shopping_cart`.`customer_id` = '81'
SELECT sum(products.product_price*quantity) as 'total'
FROM `shopping_cart`
JOIN `products` ON `products`.`ID`=`shopping_cart`.`product_id`
WHERE `customer_id` = '81'

    public function set_discount()
    {
        if ($this->request->isAJAX()) {
            $dc = $_POST["dc"];
            $json = [
                "used_discount_code" => "",
                "cart_sum" => 0,
                "products" => []
            ];
            if ($this->discount_model->where(["code"=>$dc,"is_active"=>1])->countAllResults() > 0) {
                $discount_code = $this->discount_model->where("code", $dc)->find()[0];
---
SELECT COUNT(*) AS `numrows`
FROM `discounts`
WHERE `code` = 'deneme50'
AND `is_active` = 1
SELECT *
FROM `discounts`
WHERE `code` = 'deneme50'

    public function payment()
    {
        if ($this->request->isAJAX()) {
            if (session()->has("logged") && session()->has("ID")) {
                $json=$this->request->getJSON();
                $address=$this->address_model->where("ID",$json->address_id)->find()[0];
                $customer=$this->customer_model->where("ID", $_SESSION["ID"])->find()[0];
                $arr = [
                    "conservation" => $_SESSION["ID"] . uniqid(),
                    "total" => 0,
                    "card" => [
                        "card_holder" => $json->card_holder,
                        "card_number" => $json->card_number,
                        "card_expire_month" => $json->card_month,
                        "card_expire_year" => $json->card_year,
                        "cvc" => $json->cvc
                    ],
                    "buyer" => [
                        "ID" => $_SESSION["ID"],
                        "name" => $customer["first_name"],
                        "surname" => $customer["last_name"],
                        "phone_number" => $address["phone_number"],
                        "email" => $customer["email"],
                        "address" => $address["full_address"],
                        "IP" => $this->request->getIPAddress(),
                        "city" => $this->cities_model->where("ID",$address["city"])->find()[0]["city"],
---
SELECT *
FROM `addresses`
WHERE `ID` = '10'
SELECT *
FROM `customer`
WHERE `ID` = '81'
SELECT *
FROM `cities`
WHERE `ID` = '35'