app/Controllers/Home.php

    public function __construct()
    {
        $this->db = \Config\Database::connect();
        $this->customer_model = new \App\Models\Customer();
        $this->about_us_model = new \App\Models\About_us();
        $this->address_model = new \App\Models\Addresses();
        $this->wishlist_model = new \App\Models\Wishlist();
        $this->product_model = new \App\Models\Products();
        $this->cart_model = new \App\Models\Cart();
        $this->slider_model = new \App\Models\Slider_model();
        $this->ootw = new \App\Models\Ootw();
        $this->contact_info = new \App\Models\Contact_info();
        $this->social_media = new \App\Models\Social_media();
        $this->site_general=new \App\Models\Site_general();
        $this->contact_info_data=["contact_info" =>$this->contact_info->select("phone_number,address,email")->find(1)];
        $this->social_media_data=["social_media"=>$this->social_media->select("facebook,instagram,twitter,tiktok,youtube")->find(1)];
        $this->site_general_data=["site_general"=>$this->site_general->select("logo,favicon,footer_text,copyright,header_text")->find(1)];
        session();
        if (isset($_COOKIE["remember_id"])) {
            session()->set("ID", $_COOKIE["remember_id"]);
            session()->set("logged", 1);
        }
        if ((session()->has("ID")) && (session()->has("logged"))) {
            if($this->customer_model->where("ID",session()->get("ID"))->countAllResults()==0){
---
SELECT `phone_number`, `address`, `email`
FROM `contact_info`
WHERE `contact_info`.`ID` = 1
SELECT `facebook`, `instagram`, `twitter`, `tiktok`, `youtube`
FROM `social_media`
WHERE `social_media`.`ID` = 1
SELECT `logo`, `favicon`, `footer_text`, `copyright`, `header_text`
FROM `site_general`
WHERE `site_general`.`ID` = 1
SELECT COUNT(*) AS `numrows`
FROM `customer`
WHERE `ID` = '77'

                array_push($data["categories"], $cat["category"]);
            }
        }
        $sliders = $this->slider_model->findAll();
---
SELECT *
FROM `slider`

                $data["slider"][$s["ID"]]["text"] = $s["text"];
            }
        }
        $new_products = $this->product_model
            ->select("products.ID,product_name,image,product_price,is_discounted,discounted_price")
            ->join("product_images", "product_images.product=products.ID", "inner")
            ->where(["is_new" => 1, "is_main" => 1])
            ->findAll();
---
SELECT `products`.`ID`, `product_name`, `image`, `product_price`, `is_discounted`, `discounted_price`
FROM `products`
INNER JOIN `product_images` ON `product_images`.`product`=`products`.`ID`
WHERE `is_new` = 1
AND `is_main` = 1

            $data["newest_products"][$np["ID"]]["product_name"] = $np["product_name"];
            $data["newest_products"][$np["ID"]]["product_images"] = $np["image"];
            $data["newest_products"][$np["ID"]]["product_price"] = $np["product_price"];
            if ($this->wishlist_model->where(["customer_id" => $_COOKIE["aid"] ?? session()->get("ID"), "product_id" => $np["ID"]])->countAllResults() > 0) {
---
SELECT COUNT(*) AS `numrows`
FROM `wishlist`
WHERE `customer_id` = '647899974fb145.59583835'
AND `product_id` = '3'

                $data["newest_products"][$np["ID"]]["discounted_price"] = $np["discounted_price"];
            }
        }
        $popular_products = $this->product_model
            ->select("products.ID,product_name,image,product_price,is_discounted,discounted_price")
            ->join("product_images", "product_images.product=products.ID", "inner")
            ->where("is_main", 1)
            ->orderBy("total_selled", "ASC")
            ->findAll(4);
---
SELECT `products`.`ID`, `product_name`, `image`, `product_price`, `is_discounted`, `discounted_price`
FROM `products`
INNER JOIN `product_images` ON `product_images`.`product`=`products`.`ID`
WHERE `is_main` = 1
ORDER BY `total_selled` ASC
 LIMIT 4

            $data["popular_products"][$pp["ID"]]["product_name"] = $pp["product_name"];
            $data["popular_products"][$pp["ID"]]["product_images"] = $pp["image"];
            $data["popular_products"][$pp["ID"]]["product_price"] = $pp["product_price"];
            if ($this->wishlist_model->where(["customer_id" => $_COOKIE["aid"] ?? session()->get("ID"), "product_id" => $pp["ID"]])->countAllResults() > 0) {
---
SELECT COUNT(*) AS `numrows`
FROM `wishlist`
WHERE `customer_id` = '647899974fb145.59583835'
AND `product_id` = '3'

            $data["ootw"]["offer_end"] = date("M j, Y H:i:s", strtotime($o["offer_end"]));
            $data["ootw"]["text"] = $o["text"];
        }
        $choose_us = $this->about_us_model->findAll();
---
SELECT *
FROM `about_us`

    public function contact()
    {
        $data = [
            "cart_count" => $this->cart_data,
            "contact_info" => $this->contact_info->select("phone_number,phone_number2,google_maps,email,address")->find(1),
            "social_media" => $this->social_media->select("instagram,facebook,twitter,youtube,tiktok")->find(1),
---
SELECT `phone_number`, `phone_number2`, `google_maps`, `email`, `address`
FROM `contact_info`
WHERE `contact_info`.`ID` = 1
SELECT `instagram`, `facebook`, `twitter`, `youtube`, `tiktok`
FROM `social_media`
WHERE `social_media`.`ID` = 1

    public function about_us()
    {
        $about_us = $this->about_us_model->findAll();
---
SELECT *
FROM `about_us`

    public function checkout()
    {
        if(!$this->is_logged()){
            return redirect()->to("sepet");
        }
        if (session()->has("logged") && session()->has("ID")) {
            $products = $this->cart_model
                    ->select("product_images.image,products.product_name,products.product_price,products.ID,products.is_discounted,products.discounted_price,shopping_cart.quantity")
                    ->join("products", "products.ID=shopping_cart.product_id")
                    ->join("product_images","product_images.product=products.ID")
                    ->where(["shopping_cart.customer_id"=>$_SESSION["ID"],"is_main"=>1])
                    ->findAll();
            if(count($products)==0){
                return redirect()->to("sepet");
            }
            $total=$this->cart_model
                    ->select("sum(products.product_price*shopping_cart.quantity) as 'sum'")
                    ->join("products", "products.ID=shopping_cart.product_id")
                    ->where("shopping_cart.customer_id",$_SESSION["ID"])
                    ->findAll()[0]["sum"];
            $data = [
                "cart_count" => $this->cart_data,
                "products" => $products,
                "subtotal" => 0,
                "shipping_price" => 50,
                "total" => $total,
                "addresses" => $this->address_model->where("customer_id",$_SESSION["ID"])->findAll(),
---
SELECT `product_images`.`image`, `products`.`product_name`, `products`.`product_price`, `products`.`ID`, `products`.`is_discounted`, `products`.`discounted_price`, `shopping_cart`.`quantity`
FROM `shopping_cart`
JOIN `products` ON `products`.`ID`=`shopping_cart`.`product_id`
JOIN `product_images` ON `product_images`.`product`=`products`.`ID`
WHERE `shopping_cart`.`customer_id` = '81'
AND `is_main` = 1
SELECT sum(products.product_price*shopping_cart.quantity) as 'sum'
FROM `shopping_cart`
JOIN `products` ON `products`.`ID`=`shopping_cart`.`product_id`
WHERE `shopping_cart`.`customer_id` = '81'
SELECT *
FROM `addresses`
WHERE `customer_id` = '81'