app/Controllers/Shop.php

SELECT `phone_number`, `address`, `email`
FROM `contact_info`
WHERE `contact_info`.`ID` = 1
SELECT `facebook`, `instagram`, `twitter`, `tiktok`, `youtube`
FROM `social_media`
WHERE `social_media`.`ID` = 1
SELECT `logo`, `favicon`, `footer_text`, `copyright`, `header_text`
FROM `site_general`
WHERE `site_general`.`ID` = 1
SELECT COUNT(*) AS `numrows`
FROM `customer`
WHERE `ID` = '80'
---
    public function __construct()
    {
        $this->customer_model = new \App\Models\Customer();
        $this->db = \Config\Database::connect();
        $this->product_model = new \App\Models\Products();
        $this->cart_model = new \App\Models\Cart();
        $this->wishlist_model = new \App\Models\Wishlist();
        $this->product_images = new \App\Models\Product_images();
        $this->brands_model = new \App\Models\Brands_model();
        $this->categories_model = new \App\Models\Categories_model();
        $this->contact_info=new \App\Models\Contact_info();
        $this->site_general=new \App\Models\Site_general();
        $this->social_media=new \App\Models\Social_media();
        $this->contact_info_data=["contact_info" =>$this->contact_info->select("phone_number,address,email")->find(1)];
        $this->social_media_data=["social_media"=>$this->social_media->select("facebook,instagram,twitter,tiktok,youtube")->find(1)];
        $this->site_general_data=["site_general"=>$this->site_general->select("logo,favicon,footer_text,copyright,header_text")->find(1)];
        session();
        if ((session()->has("ID")) && (session()->has("logged"))) {
            if($this->customer_model->where("ID",session()->get("ID"))->countAllResults()==0){

SELECT *
FROM `products`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `products`
---
    public function index()
    {
        $limit = 10;
        $data = [
            "cart_count" => $this->cart_data,
            "categories" => $this->buildTree(0),
            "brands" => [],
            "brands_id" => [],
            "is_mobile" => false,
            'product_paginate' => $this->product_model->paginate($limit),
            'pager' => $this->product_model->pager,
            "start",
            "finish",
            "product_count" => $this->product_model->countAllResults(),

SELECT COUNT(*) AS `numrows`
FROM `wishlist`
WHERE `customer_id` = '67c60107557872.40434195'
AND `product_id` = '6'
---
                $data["products"][$p["ID"]]["discounted_price"]= $p["discounted_price"];
                $data["products"][$p["ID"]]["is_new"] =$p["is_new"];
                $data["products"][$p["ID"]]["product_images"]= $p["image"];
                if($this->wishlist_model->where(["customer_id"=>$_COOKIE["aid"] ?? session()->get("ID"),"product_id"=>$p["ID"]])->countAllResults()>0){

SELECT *
FROM `products`
WHERE `product_name` = 'RubaTrend Kalıcı Takma Tırnak Badem Şekilli Model Set 24 Adet'
SELECT *
FROM `product_desc`
WHERE `product_id` = '50'
SELECT `ID`, `image`, `is_main`
FROM `product_images`
WHERE `product` = '50'
---
    public function product($pn)
    {
        $this->product_desc_model=new \App\Models\Product_desc();
        $this->product_comments=new \App\Models\Product_comments();
        $product = $this->product_model
        ->where("product_name", $pn)->find()[0];
        $data = [
            "cart_count" => $this->cart_data,
            ...$this->contact_info_data,
            ...$this->social_media_data,
            ...$this->site_general_data,
            "product"=>[
                "ID"=>0,
                "avrage"=>0.0,
                "product_brand"=>"",
                "product_category"=>"",
                "is_customer_already_commented"=>false,
                "product_name"=>"",
                "product_price"=>0,
                "product_status"=>0,
                "product_desc"=>$this->product_desc_model->where("product_id",$product["ID"])->find()[0]["desc"] ?? "",
                "is_wishlisted"=>false,
                "images"=>[],
                "comments"=>[],
                "features"=>[]
            ]
        ];
        $product_images=$this->product_images->select("ID,image,is_main")->where("product",$product["ID"])->findAll();

SELECT `customer`.`full_name`, `product_comments`.`ID`, `product_comments`.`comment`, `product_comments`.`star`, `product_comments`.`date`, `product_comments`.`customer_id`
FROM `product_comments`
JOIN `customer` ON `customer`.`ID`=`product_comments`.`customer_id`
WHERE `product_id` = '50'
SELECT SUM(product_comments.star)/count(product_comments.comment) as 'ortalama'
FROM `product_comments`
---
            $data["product"]["is_wishlisted"]=true;
        }
        //product comments
        $product_comments=$this->product_comments->select("customer.full_name,product_comments.ID,product_comments.comment,product_comments.star,product_comments.date,product_comments.customer_id")
        ->join("customer","customer.ID=product_comments.customer_id")
        ->where("product_id",$product["ID"])
        ->findAll();
        $product_star_avrage=$this->product_comments->select("SUM(product_comments.star)/count(product_comments.comment) as 'ortalama'")->find()[0];