app/Controllers/Wishlist.php

    public function __construct()
    {
        $this->db = \Config\Database::connect();
        $this->product_model = new \App\Models\Products();
        $this->cart_model = new \App\Models\Cart();
        $this->customer_model = new \App\Models\Customer();
        $this->wishlist_model = new \App\Models\Wishlist();
        $this->contact_info=new \App\Models\Contact_info();
        $this->site_general=new \App\Models\Site_general();
        $this->social_media=new \App\Models\Social_media();
        $this->contact_info_data=["contact_info" =>$this->contact_info->select("phone_number,address,email")->find(1)];
        $this->social_media_data=["social_media"=>$this->social_media->select("facebook,instagram,twitter,tiktok,youtube")->find(1)];
        $this->site_general_data=["site_general"=>$this->site_general->select("logo,favicon,footer_text,copyright,header_text")->find(1)];
        session();
        if ((session()->has("ID")) && (session()->has("logged"))) {
            if($this->customer_model->where("ID",session()->get("ID"))->countAllResults()==0){
---
SELECT `phone_number`, `address`, `email`
FROM `contact_info`
WHERE `contact_info`.`ID` = 1
SELECT `facebook`, `instagram`, `twitter`, `tiktok`, `youtube`
FROM `social_media`
WHERE `social_media`.`ID` = 1
SELECT `logo`, `favicon`, `footer_text`, `copyright`, `header_text`
FROM `site_general`
WHERE `site_general`.`ID` = 1
SELECT COUNT(*) AS `numrows`
FROM `customer`
WHERE `ID` = '80'

    public function index()
    {
        $data = [
            "cart_count" => $this->cart_data,
            "product_id" => [],
            "product_name" => [],
            "product_price" => [],
            "product_color" => [],
            "product_images"=>[],
            "product_status" => [],
            "product_status_number" => [],
            ...$this->contact_info_data,
            ...$this->social_media_data,
            ...$this->site_general_data,
        ];
        if (isset($_SESSION["logged"]) && isset($_SESSION["ID"])) {
            $user_wishlist = $this->wishlist_model->where('customer_id', session()->get("ID"))->findAll();
---
SELECT *
FROM `wishlist`
WHERE `customer_id` = '80'